{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.890000, with prediction time: 1.620255\
Total train time: 47.256762 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_381 (Conv2D)          (None, 28, 28, 128)       1280      \
_________________________________________________________________\
batch_normalization_262 (Bat (None, 28, 28, 128)       512       \
_________________________________________________________________\
activation_435 (Activation)  (None, 28, 28, 128)       0         \
_________________________________________________________________\
conv2d_382 (Conv2D)          (None, 28, 28, 64)        204864    \
_________________________________________________________________\
activation_436 (Activation)  (None, 28, 28, 64)        0         \
_________________________________________________________________\
dropout_310 (Dropout)        (None, 28, 28, 64)        0         \
_________________________________________________________________\
max_pooling2d_191 (MaxPoolin (None, 14, 14, 64)        0         \
_________________________________________________________________\
conv2d_383 (Conv2D)          (None, 14, 14, 32)        51232     \
_________________________________________________________________\
activation_437 (Activation)  (None, 14, 14, 32)        0         \
_________________________________________________________________\
dropout_311 (Dropout)        (None, 14, 14, 32)        0         \
_________________________________________________________________\
max_pooling2d_192 (MaxPoolin (None, 7, 7, 32)          0         \
_________________________________________________________________\
conv2d_384 (Conv2D)          (None, 7, 7, 8)           2312      \
_________________________________________________________________\
batch_normalization_263 (Bat (None, 7, 7, 8)           32        \
_________________________________________________________________\
activation_438 (Activation)  (None, 7, 7, 8)           0         \
_________________________________________________________________\
dropout_312 (Dropout)        (None, 7, 7, 8)           0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 392)               0         \
_________________________________________________________________\
dense_155 (Dense)            (None, 10)                3930      \
=================================================================\
Total params: 264,162\
Trainable params: 263,890\
Non-trainable params: 272}