{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.868000, with prediction time: 0.239355\
Total train time: 62.813831 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_434 (Conv2D)          (None, 28, 28, 64)        1664      \
_________________________________________________________________\
batch_normalization_319 (Bat (None, 28, 28, 64)        256       \
_________________________________________________________________\
activation_501 (Activation)  (None, 28, 28, 64)        0         \
_________________________________________________________________\
dropout_376 (Dropout)        (None, 28, 28, 64)        0         \
_________________________________________________________________\
max_pooling2d_195 (MaxPoolin (None, 14, 14, 64)        0         \
_________________________________________________________________\
max_pooling2d_196 (MaxPoolin (None, 7, 7, 64)          0         \
_________________________________________________________________\
conv2d_435 (Conv2D)          (None, 7, 7, 128)         73856     \
_________________________________________________________________\
batch_normalization_320 (Bat (None, 7, 7, 128)         512       \
_________________________________________________________________\
activation_502 (Activation)  (None, 7, 7, 128)         0         \
_________________________________________________________________\
dropout_377 (Dropout)        (None, 7, 7, 128)         0         \
_________________________________________________________________\
conv2d_436 (Conv2D)          (None, 7, 7, 64)          73792     \
_________________________________________________________________\
batch_normalization_321 (Bat (None, 7, 7, 64)          256       \
_________________________________________________________________\
activation_503 (Activation)  (None, 7, 7, 64)          0         \
_________________________________________________________________\
conv2d_437 (Conv2D)          (None, 7, 7, 4)           6404      \
_________________________________________________________________\
batch_normalization_322 (Bat (None, 7, 7, 4)           16        \
_________________________________________________________________\
activation_504 (Activation)  (None, 7, 7, 4)           0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 196)               0         \
_________________________________________________________________\
dense_168 (Dense)            (None, 10)                1970      \
=================================================================\
Total params: 158,726\
Trainable params: 158,206\
Non-trainable params: 520\
_________________________________________________________________\
Best model: None}