{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.886000, with prediction time: 0.307468\
Total train time: 73.856190 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_388 (Conv2D)          (None, 28, 28, 32)        320       \
_________________________________________________________________\
activation_487 (Activation)  (None, 28, 28, 32)        0         \
_________________________________________________________________\
max_pooling2d_199 (MaxPoolin (None, 14, 14, 32)        0         \
_________________________________________________________________\
conv2d_389 (Conv2D)          (None, 14, 14, 32)        25632     \
_________________________________________________________________\
activation_488 (Activation)  (None, 14, 14, 32)        0         \
_________________________________________________________________\
dropout_325 (Dropout)        (None, 14, 14, 32)        0         \
_________________________________________________________________\
conv2d_390 (Conv2D)          (None, 14, 14, 128)       102528    \
_________________________________________________________________\
activation_489 (Activation)  (None, 14, 14, 128)       0         \
_________________________________________________________________\
dropout_326 (Dropout)        (None, 14, 14, 128)       0         \
_________________________________________________________________\
max_pooling2d_200 (MaxPoolin (None, 7, 7, 128)         0         \
_________________________________________________________________\
conv2d_391 (Conv2D)          (None, 7, 7, 8)           9224      \
_________________________________________________________________\
batch_normalization_293 (Bat (None, 7, 7, 8)           32        \
_________________________________________________________________\
activation_490 (Activation)  (None, 7, 7, 8)           0         \
_________________________________________________________________\
dropout_327 (Dropout)        (None, 7, 7, 8)           0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 392)               0         \
_________________________________________________________________\
dense_200 (Dense)            (None, 10)                3930      \
=================================================================\
Total params: 141,666\
Trainable params: 141,650\
Non-trainable params: 16\
_________________________________________________________________\
Best model: None}