{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.860000, with prediction time: 0.156011\
Total train time: 55.927247 min\
Model: "model_110"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_110 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_386 (Conv2D)          (None, 28, 28, 32)        832       \
_________________________________________________________________\
batch_normalization_298 (Bat (None, 28, 28, 32)        128       \
_________________________________________________________________\
activation_419 (Activation)  (None, 28, 28, 32)        0         \
_________________________________________________________________\
dropout_293 (Dropout)        (None, 28, 28, 32)        0         \
_________________________________________________________________\
max_pooling2d_215 (MaxPoolin (None, 14, 14, 32)        0         \
_________________________________________________________________\
conv2d_387 (Conv2D)          (None, 14, 14, 64)        18496     \
_________________________________________________________________\
batch_normalization_299 (Bat (None, 14, 14, 64)        256       \
_________________________________________________________________\
activation_420 (Activation)  (None, 14, 14, 64)        0         \
_________________________________________________________________\
dropout_294 (Dropout)        (None, 14, 14, 64)        0         \
_________________________________________________________________\
max_pooling2d_216 (MaxPoolin (None, 7, 7, 64)          0         \
_________________________________________________________________\
conv2d_388 (Conv2D)          (None, 7, 7, 4)           2308      \
_________________________________________________________________\
batch_normalization_300 (Bat (None, 7, 7, 4)           16        \
_________________________________________________________________\
activation_421 (Activation)  (None, 7, 7, 4)           0         \
_________________________________________________________________\
conv2d_389 (Conv2D)          (None, 7, 7, 8)           808       \
_________________________________________________________________\
activation_422 (Activation)  (None, 7, 7, 8)           0         \
_________________________________________________________________\
dropout_295 (Dropout)        (None, 7, 7, 8)           0         \
_________________________________________________________________\
flatten_110 (Flatten)        (None, 392)               0         \
_________________________________________________________________\
dense_143 (Dense)            (None, 10)                3930      \
=================================================================\
Total params: 26,774\
Trainable params: 26,574\
Non-trainable params: 200\
_________________________________________________________________\
Best model: None}