{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.868000, with prediction time: 0.282750\
Total train time: 69.367397 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_357 (Conv2D)          (None, 28, 28, 32)        320       \
_________________________________________________________________\
activation_445 (Activation)  (None, 28, 28, 32)        0         \
_________________________________________________________________\
dropout_356 (Dropout)        (None, 28, 28, 32)        0         \
_________________________________________________________________\
max_pooling2d_192 (MaxPoolin (None, 14, 14, 32)        0         \
_________________________________________________________________\
conv2d_358 (Conv2D)          (None, 14, 14, 128)       102528    \
_________________________________________________________________\
batch_normalization_229 (Bat (None, 14, 14, 128)       512       \
_________________________________________________________________\
activation_446 (Activation)  (None, 14, 14, 128)       0         \
_________________________________________________________________\
dropout_357 (Dropout)        (None, 14, 14, 128)       0         \
_________________________________________________________________\
max_pooling2d_193 (MaxPoolin (None, 7, 7, 128)         0         \
_________________________________________________________________\
conv2d_359 (Conv2D)          (None, 7, 7, 16)          18448     \
_________________________________________________________________\
batch_normalization_230 (Bat (None, 7, 7, 16)          64        \
_________________________________________________________________\
activation_447 (Activation)  (None, 7, 7, 16)          0         \
_________________________________________________________________\
dropout_358 (Dropout)        (None, 7, 7, 16)          0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 784)               0         \
_________________________________________________________________\
dense_189 (Dense)            (None, 512)               401920    \
_________________________________________________________________\
activation_448 (Activation)  (None, 512)               0         \
_________________________________________________________________\
dropout_359 (Dropout)        (None, 512)               0         \
_________________________________________________________________\
dense_190 (Dense)            (None, 10)                5130      \
=================================================================\
Total params: 528,922\
Trainable params: 528,634\
Non-trainable params: 288\
_________________________________________________________________\
Best model: None}