{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.884000, with prediction time: 0.080398\
Total train time: 37.415634 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_383 (Conv2D)          (None, 28, 28, 16)        416       \
_________________________________________________________________\
batch_normalization_249 (Bat (None, 28, 28, 16)        64        \
_________________________________________________________________\
activation_410 (Activation)  (None, 28, 28, 16)        0         \
_________________________________________________________________\
max_pooling2d_201 (MaxPoolin (None, 14, 14, 16)        0         \
_________________________________________________________________\
max_pooling2d_202 (MaxPoolin (None, 7, 7, 16)          0         \
_________________________________________________________________\
conv2d_384 (Conv2D)          (None, 7, 7, 32)          12832     \
_________________________________________________________________\
batch_normalization_250 (Bat (None, 7, 7, 32)          128       \
_________________________________________________________________\
activation_411 (Activation)  (None, 7, 7, 32)          0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 1568)              0         \
_________________________________________________________________\
dense_128 (Dense)            (None, 10)                15690     \
=================================================================\
Total params: 29,130\
Trainable params: 29,034\
Non-trainable params: 96\
_________________________________________________________________\
\pard\tx3438\pardeftab720\partightenfactor0
\cf0 Best model: None}