{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.884000, with prediction time: 0.436030\
Total train time: 27.871588 min\
Model: "model_110"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_110 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_372 (Conv2D)          (None, 28, 28, 16)        160       \
_________________________________________________________________\
activation_398 (Activation)  (None, 28, 28, 16)        0         \
_________________________________________________________________\
dropout_289 (Dropout)        (None, 28, 28, 16)        0         \
_________________________________________________________________\
max_pooling2d_216 (MaxPoolin (None, 14, 14, 16)        0         \
_________________________________________________________________\
conv2d_373 (Conv2D)          (None, 14, 14, 128)       18560     \
_________________________________________________________________\
activation_399 (Activation)  (None, 14, 14, 128)       0         \
_________________________________________________________________\
dropout_290 (Dropout)        (None, 14, 14, 128)       0         \
_________________________________________________________________\
conv2d_374 (Conv2D)          (None, 14, 14, 64)        204864    \
_________________________________________________________________\
batch_normalization_179 (Bat (None, 14, 14, 64)        256       \
_________________________________________________________________\
activation_400 (Activation)  (None, 14, 14, 64)        0         \
_________________________________________________________________\
dropout_291 (Dropout)        (None, 14, 14, 64)        0         \
_________________________________________________________________\
max_pooling2d_217 (MaxPoolin (None, 7, 7, 64)          0         \
_________________________________________________________________\
conv2d_375 (Conv2D)          (None, 7, 7, 8)           4616      \
_________________________________________________________________\
batch_normalization_180 (Bat (None, 7, 7, 8)           32        \
_________________________________________________________________\
activation_401 (Activation)  (None, 7, 7, 8)           0         \
_________________________________________________________________\
dropout_292 (Dropout)        (None, 7, 7, 8)           0         \
_________________________________________________________________\
flatten_110 (Flatten)        (None, 392)               0         \
_________________________________________________________________\
dense_136 (Dense)            (None, 10)                3930      \
=================================================================\
Total params: 232,418\
Trainable params: 232,274\
Non-trainable params: 144\
_________________________________________________________________\
Best model: None}