{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.886000, with prediction time: 0.367307\
Total train time: 45.677951 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_339 (Conv2D)          (None, 28, 28, 128)       3328      \
_________________________________________________________________\
activation_390 (Activation)  (None, 28, 28, 128)       0         \
_________________________________________________________________\
dropout_274 (Dropout)        (None, 28, 28, 128)       0         \
_________________________________________________________________\
max_pooling2d_194 (MaxPoolin (None, 14, 14, 128)       0         \
_________________________________________________________________\
conv2d_340 (Conv2D)          (None, 14, 14, 16)        51216     \
_________________________________________________________________\
activation_391 (Activation)  (None, 14, 14, 16)        0         \
_________________________________________________________________\
dropout_275 (Dropout)        (None, 14, 14, 16)        0         \
_________________________________________________________________\
max_pooling2d_195 (MaxPoolin (None, 7, 7, 16)          0         \
_________________________________________________________________\
conv2d_341 (Conv2D)          (None, 7, 7, 64)          9280      \
_________________________________________________________________\
batch_normalization_247 (Bat (None, 7, 7, 64)          256       \
_________________________________________________________________\
activation_392 (Activation)  (None, 7, 7, 64)          0         \
_________________________________________________________________\
dropout_276 (Dropout)        (None, 7, 7, 64)          0         \
_________________________________________________________________\
conv2d_342 (Conv2D)          (None, 7, 7, 128)         204928    \
_________________________________________________________________\
batch_normalization_248 (Bat (None, 7, 7, 128)         512       \
_________________________________________________________________\
activation_393 (Activation)  (None, 7, 7, 128)         0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 6272)              0         \
_________________________________________________________________\
dense_152 (Dense)            (None, 128)               802944    \
_________________________________________________________________\
batch_normalization_249 (Bat (None, 128)               512       \
_________________________________________________________________\
activation_394 (Activation)  (None, 128)               0         \
_________________________________________________________________\
dropout_277 (Dropout)        (None, 128)               0         \
_________________________________________________________________\
dense_153 (Dense)            (None, 10)                1290      \
=================================================================\
Total params: 1,074,266\
Trainable params: 1,073,626\
Non-trainable params: 640\
_________________________________________________________________\
Best model: None}