{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.862000, with prediction time: 0.855256\
Total train time: 48.837789 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_440 (Conv2D)          (None, 28, 28, 64)        1664      \
_________________________________________________________________\
batch_normalization_320 (Bat (None, 28, 28, 64)        256       \
_________________________________________________________________\
activation_465 (Activation)  (None, 28, 28, 64)        0         \
_________________________________________________________________\
conv2d_441 (Conv2D)          (None, 28, 28, 64)        102464    \
_________________________________________________________________\
batch_normalization_321 (Bat (None, 28, 28, 64)        256       \
_________________________________________________________________\
activation_466 (Activation)  (None, 28, 28, 64)        0         \
_________________________________________________________________\
dropout_326 (Dropout)        (None, 28, 28, 64)        0         \
_________________________________________________________________\
max_pooling2d_201 (MaxPoolin (None, 14, 14, 64)        0         \
_________________________________________________________________\
conv2d_442 (Conv2D)          (None, 14, 14, 4)         2308      \
_________________________________________________________________\
batch_normalization_322 (Bat (None, 14, 14, 4)         16        \
_________________________________________________________________\
activation_467 (Activation)  (None, 14, 14, 4)         0         \
_________________________________________________________________\
max_pooling2d_202 (MaxPoolin (None, 7, 7, 4)           0         \
_________________________________________________________________\
conv2d_443 (Conv2D)          (None, 7, 7, 8)           296       \
_________________________________________________________________\
batch_normalization_323 (Bat (None, 7, 7, 8)           32        \
_________________________________________________________________\
activation_468 (Activation)  (None, 7, 7, 8)           0         \
_________________________________________________________________\
dropout_327 (Dropout)        (None, 7, 7, 8)           0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 392)               0         \
_________________________________________________________________\
dense_126 (Dense)            (None, 10)                3930      \
=================================================================\
Total params: 111,222\
Trainable params: 110,942\
Non-trainable params: 280\
_________________________________________________________________\
Best model: None\
}