{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.882000, with prediction time: 1.444336\
Total train time: 79.294129 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_385 (Conv2D)          (None, 28, 28, 128)       1280      \
_________________________________________________________________\
activation_419 (Activation)  (None, 28, 28, 128)       0         \
_________________________________________________________________\
dropout_312 (Dropout)        (None, 28, 28, 128)       0         \
_________________________________________________________________\
conv2d_386 (Conv2D)          (None, 28, 28, 128)       147584    \
_________________________________________________________________\
batch_normalization_219 (Bat (None, 28, 28, 128)       512       \
_________________________________________________________________\
activation_420 (Activation)  (None, 28, 28, 128)       0         \
_________________________________________________________________\
dropout_313 (Dropout)        (None, 28, 28, 128)       0         \
_________________________________________________________________\
max_pooling2d_191 (MaxPoolin (None, 14, 14, 128)       0         \
_________________________________________________________________\
conv2d_387 (Conv2D)          (None, 14, 14, 16)        51216     \
_________________________________________________________________\
activation_421 (Activation)  (None, 14, 14, 16)        0         \
_________________________________________________________________\
dropout_314 (Dropout)        (None, 14, 14, 16)        0         \
_________________________________________________________________\
conv2d_388 (Conv2D)          (None, 14, 14, 64)        25664     \
_________________________________________________________________\
batch_normalization_220 (Bat (None, 14, 14, 64)        256       \
_________________________________________________________________\
activation_422 (Activation)  (None, 14, 14, 64)        0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 12544)             0         \
_________________________________________________________________\
dense_135 (Dense)            (None, 1024)              12846080  \
_________________________________________________________________\
batch_normalization_221 (Bat (None, 1024)              4096      \
_________________________________________________________________\
activation_423 (Activation)  (None, 1024)              0         \
_________________________________________________________________\
dropout_315 (Dropout)        (None, 1024)              0         \
_________________________________________________________________\
dense_136 (Dense)            (None, 10)                10250     \
=================================================================\
Total params: 13,086,938\
Trainable params: 13,084,506\
Non-trainable params: 2,432\
_________________________________________________________________\
Best model: None}