{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.874000, with prediction time: 3.695920\
Total train time: 86.856022 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_354 (Conv2D)          (None, 28, 28, 16)        416       \
_________________________________________________________________\
batch_normalization_244 (Bat (None, 28, 28, 16)        64        \
_________________________________________________________________\
activation_408 (Activation)  (None, 28, 28, 16)        0         \
_________________________________________________________________\
dropout_345 (Dropout)        (None, 28, 28, 16)        0         \
_________________________________________________________________\
conv2d_355 (Conv2D)          (None, 28, 28, 128)       51328     \
_________________________________________________________________\
activation_409 (Activation)  (None, 28, 28, 128)       0         \
_________________________________________________________________\
dropout_346 (Dropout)        (None, 28, 28, 128)       0         \
_________________________________________________________________\
conv2d_356 (Conv2D)          (None, 28, 28, 64)        204864    \
_________________________________________________________________\
activation_410 (Activation)  (None, 28, 28, 64)        0         \
_________________________________________________________________\
dropout_347 (Dropout)        (None, 28, 28, 64)        0         \
_________________________________________________________________\
max_pooling2d_186 (MaxPoolin (None, 14, 14, 64)        0         \
_________________________________________________________________\
conv2d_357 (Conv2D)          (None, 14, 14, 128)       204928    \
_________________________________________________________________\
batch_normalization_245 (Bat (None, 14, 14, 128)       512       \
_________________________________________________________________\
activation_411 (Activation)  (None, 14, 14, 128)       0         \
_________________________________________________________________\
dropout_348 (Dropout)        (None, 14, 14, 128)       0         \
_________________________________________________________________\
conv2d_358 (Conv2D)          (None, 14, 14, 128)       147584    \
_________________________________________________________________\
activation_412 (Activation)  (None, 14, 14, 128)       0         \
_________________________________________________________________\
dropout_349 (Dropout)        (None, 14, 14, 128)       0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 25088)             0         \
_________________________________________________________________\
dense_155 (Dense)            (None, 10)                250890    \
=================================================================\
Total params: 860,586\
Trainable params: 860,298\
Non-trainable params: 288\
_________________________________________________________________\
Best model: None}