{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.860000, with prediction time: 0.228374\
Total train time: 62.814454 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_392 (Conv2D)          (None, 28, 28, 64)        1664      \
_________________________________________________________________\
batch_normalization_252 (Bat (None, 28, 28, 64)        256       \
_________________________________________________________________\
activation_445 (Activation)  (None, 28, 28, 64)        0         \
_________________________________________________________________\
dropout_306 (Dropout)        (None, 28, 28, 64)        0         \
_________________________________________________________________\
max_pooling2d_198 (MaxPoolin (None, 14, 14, 64)        0         \
_________________________________________________________________\
max_pooling2d_199 (MaxPoolin (None, 7, 7, 64)          0         \
_________________________________________________________________\
conv2d_393 (Conv2D)          (None, 7, 7, 64)          36928     \
_________________________________________________________________\
batch_normalization_253 (Bat (None, 7, 7, 64)          256       \
_________________________________________________________________\
activation_446 (Activation)  (None, 7, 7, 64)          0         \
_________________________________________________________________\
dropout_307 (Dropout)        (None, 7, 7, 64)          0         \
_________________________________________________________________\
conv2d_394 (Conv2D)          (None, 7, 7, 128)         73856     \
_________________________________________________________________\
batch_normalization_254 (Bat (None, 7, 7, 128)         512       \
_________________________________________________________________\
activation_447 (Activation)  (None, 7, 7, 128)         0         \
_________________________________________________________________\
conv2d_395 (Conv2D)          (None, 7, 7, 4)           12804     \
_________________________________________________________________\
activation_448 (Activation)  (None, 7, 7, 4)           0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 196)               0         \
_________________________________________________________________\
dense_154 (Dense)            (None, 10)                1970      \
=================================================================\
Total params: 128,246\
Trainable params: 127,734\
Non-trainable params: 512\
_________________________________________________________________\
Best model: None}