{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.878000, with prediction time: 0.218761\
Total train time: 102.636320 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_413 (Conv2D)          (None, 28, 28, 4)         104       \
_________________________________________________________________\
batch_normalization_250 (Bat (None, 28, 28, 4)         16        \
_________________________________________________________________\
activation_453 (Activation)  (None, 28, 28, 4)         0         \
_________________________________________________________________\
dropout_312 (Dropout)        (None, 28, 28, 4)         0         \
_________________________________________________________________\
conv2d_414 (Conv2D)          (None, 28, 28, 128)       4736      \
_________________________________________________________________\
activation_454 (Activation)  (None, 28, 28, 128)       0         \
_________________________________________________________________\
dropout_313 (Dropout)        (None, 28, 28, 128)       0         \
_________________________________________________________________\
max_pooling2d_169 (MaxPoolin (None, 14, 14, 128)       0         \
_________________________________________________________________\
conv2d_415 (Conv2D)          (None, 14, 14, 16)        18448     \
_________________________________________________________________\
batch_normalization_251 (Bat (None, 14, 14, 16)        64        \
_________________________________________________________________\
activation_455 (Activation)  (None, 14, 14, 16)        0         \
_________________________________________________________________\
dropout_314 (Dropout)        (None, 14, 14, 16)        0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 3136)              0         \
_________________________________________________________________\
dense_141 (Dense)            (None, 10)                31370     \
=================================================================\
Total params: 54,738\
Trainable params: 54,698\
Non-trainable params: 40\
_________________________________________________________________\
Best model: None}