{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf610
{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c100000\c100000\c100000;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs28 \cf0 \cb2 \expnd0\expndtw0\kerning0
Best error: 0.878000, with prediction time: 0.429116\
Total train time: 55.253684 min\
Model: "model_101"\
_________________________________________________________________\
Layer (type)                 Output Shape              Param #   \
=================================================================\
input_101 (InputLayer)       (None, 28, 28, 1)         0         \
_________________________________________________________________\
conv2d_324 (Conv2D)          (None, 28, 28, 128)       1280      \
_________________________________________________________________\
batch_normalization_195 (Bat (None, 28, 28, 128)       512       \
_________________________________________________________________\
activation_360 (Activation)  (None, 28, 28, 128)       0         \
_________________________________________________________________\
dropout_292 (Dropout)        (None, 28, 28, 128)       0         \
_________________________________________________________________\
max_pooling2d_197 (MaxPoolin (None, 14, 14, 128)       0         \
_________________________________________________________________\
max_pooling2d_198 (MaxPoolin (None, 7, 7, 128)         0         \
_________________________________________________________________\
conv2d_325 (Conv2D)          (None, 7, 7, 128)         409728    \
_________________________________________________________________\
batch_normalization_196 (Bat (None, 7, 7, 128)         512       \
_________________________________________________________________\
activation_361 (Activation)  (None, 7, 7, 128)         0         \
_________________________________________________________________\
conv2d_326 (Conv2D)          (None, 7, 7, 64)          73792     \
_________________________________________________________________\
activation_362 (Activation)  (None, 7, 7, 64)          0         \
_________________________________________________________________\
dropout_293 (Dropout)        (None, 7, 7, 64)          0         \
_________________________________________________________________\
flatten_101 (Flatten)        (None, 3136)              0         \
_________________________________________________________________\
dense_137 (Dense)            (None, 10)                31370     \
=================================================================\
Total params: 517,194\
Trainable params: 516,682\
Non-trainable params: 512\
_________________________________________________________________\
Best model: None}