Best error: 0.918833, with prediction time: 0.644990
Total train time: 30.355274 min
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 28, 28, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 4)         104       
_________________________________________________________________
batch_normalization_1 (Batch (None, 28, 28, 4)         16        
_________________________________________________________________
activation_1 (Activation)    (None, 28, 28, 4)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 28, 28, 4)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 8)         808       
_________________________________________________________________
batch_normalization_2 (Batch (None, 28, 28, 8)         32        
_________________________________________________________________
activation_2 (Activation)    (None, 28, 28, 8)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 28, 28, 8)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 128)       25728     
_________________________________________________________________
activation_3 (Activation)    (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 64)        73792     
_________________________________________________________________
activation_4 (Activation)    (None, 28, 28, 64)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 28, 28, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 28, 28, 64)        36928     
_________________________________________________________________
activation_5 (Activation)    (None, 28, 28, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 12544)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                125450    
=================================================================
Total params: 262,858
Trainable params: 262,834
Non-trainable params: 24
_________________________________________________________________
Best model: None
