Best error: 0.926667, with prediction time: 0.689980
Total train time: 37.405120 min
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 28, 28, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        1664      
_________________________________________________________________
activation_1 (Activation)    (None, 28, 28, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 28, 28, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 128)       204928    
_________________________________________________________________
batch_normalization_1 (Batch (None, 28, 28, 128)       512       
_________________________________________________________________
activation_2 (Activation)    (None, 28, 28, 128)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 4)         4612      
_________________________________________________________________
batch_normalization_2 (Batch (None, 28, 28, 4)         16        
_________________________________________________________________
activation_3 (Activation)    (None, 28, 28, 4)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 28, 28, 4)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 4)         404       
_________________________________________________________________
batch_normalization_3 (Batch (None, 28, 28, 4)         16        
_________________________________________________________________
activation_4 (Activation)    (None, 28, 28, 4)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 28, 28, 4)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 28, 28, 64)        2368      
_________________________________________________________________
activation_5 (Activation)    (None, 28, 28, 64)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 28, 28, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 12544)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               1605760   
_________________________________________________________________
activation_6 (Activation)    (None, 128)               0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                1290      
=================================================================
Total params: 1,821,570
Trainable params: 1,821,298
Non-trainable params: 272
_________________________________________________________________
Best model: None
