Best error: 0.882000, with prediction time: 0.128374
Total train time: 55.822796 min
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 28, 28, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 4)         40        
_________________________________________________________________
batch_normalization_1 (Batch (None, 28, 28, 4)         16        
_________________________________________________________________
activation_1 (Activation)    (None, 28, 28, 4)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 28, 28, 4)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 64)        6464      
_________________________________________________________________
activation_2 (Activation)    (None, 28, 28, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 28, 28, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                31370     
=================================================================
Total params: 37,890
Trainable params: 37,882
Non-trainable params: 8
_________________________________________________________________
Best model: None
